{
  "color": "3999E5",
  "section": [
    {
      "content": "Kickstarting his career doing concert visuals and general abstract 3D work using Blender, [Ducky 3D](https://www.youtube.com/channel/UCuNhGhbemBkdflZ1FGJ0lUQ) is introducing Blender as a feasible MoGraph tool through popular YouTube tutorials and other social media outlets. His primary focus is Blender education and abstract freelance work for music artists, especially clients who have events and are a part of music festivals.\n\nSome of his clients consist of [Justin Caruso and Jake Miller](https://youtu.be/TRh964Gvsfw), [Nitti Gritti](https://youtu.be/WnQ9dwJTxPk), [PLAYERONE](https://youtu.be/dbAk1Oq2nyw), and more. Along with other popular Blender YouTubers, Ducky 3D is pushing the limits with what you can do with Blender, demonstrating how you can utilize open-source software to create professional-looking visuals that anyone has access to, opposed to using software like Autodesk Maya, 3ds Max, Maxon Cinema 4D, and other expensive tools.\n\nAs Blender is growing as a product and community, exposing that Blender is a very competitive software and is up against industry standard programs is important to not only hobbyists but creative professionals too. This is one of many of Ducky 3D's goals as a Blender educator"
    },
    {
      "content": "## Problem\n\nNearing 100,000 subscribers on YouTube and over 20,000 followers on Instagram as of March 2020, creating a consistence brand that accurately represents Ducky 3D was extremely vital. More eyes on his work and content on YouTube means more recognition to his work and brand as a whole.\n\nOne of the first steps was to gather some insight from Nathan and what type of content he produces for clients and his audience and reflect on how effective his previous identity was.\n\nThroughout his previous branding, there was not much consistency, where his site had a particular distinct still, whereas his social media accounts varied per platform. This causes disconnect and even confusion with anyone interacting with his brand and viewing his content, as if his YouTube does not directly relate to the content he produces on other platforms like Instagram."
    },
    {
      "content": "## Research\n\nEspecially since the creative industry is saturated with all kinds of artists, creating a brand that uniquely identifies Ducky 3D as a 3D artist who also creates insightful tutorials for MoGraph related subjects in Blender requires extensive research and competitive analysis."
    },
    {
      "content": "## Ideation"
    },
    {
      "content": "## Solution\n\n![Finalized Ducky 3D logo](/img/dfgdfg.png \"Ducky 3D Logo\")\n\n![Variations of the new Ducky 3D logo](/img/ducky3d_solution1.jpg \"Ducky 3D Logos\")\n\n![Ducky 3D brand color palette](/img/ducky3d_solution2.jpg \"Ducky 3D brand color palette\")\n\n<iframe style=\"border: none;\" width=\"800\" height=\"450\" src=\"https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2F9hzLwFFo7l0ndSNMKGp76n%2Fpresentation%3Fnode-id%3D0%253A1\" allowfullscreen></iframe>"
    }
  ],
  "for": "Ducky 3D (Nathan Duck)",
  "thumbnail": "/img/dfgdfg.png",
  "duration": "December 2019 — February 2020",
  "role": "Developing a new identity, site, and social media assets for Ducky 3D.",
  "feature": "/img/ducky3d_feature.jpg",
  "title": "Ducky 3D",
  "description": "Re-imagining the brand for a known 3D artist, who creates tutorials and artwork primarily using Blender.",
  "category": "Brand Identity"
}